W6D4/first_routes_controllers copy/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "radio_man"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    if params[:username]
      @users = [User.find_by(username: params[:username])]
    else
      @users = User.all

INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "Darrick"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @users = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Billy"], ["email", "\"billy@io\""], ["id", 1]]
---
  def update
    user = User.find_by(id: params[:id])
    if user
      user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    user = User.find_by(id: params[:id])
    if user
      user.destroy